mva-ru/STM32-FSMC-DMA-SRAM-IS62WV51216/Library/hal_is62wv51216.h
#ifndef HAL_IS62WV51216_H
#define HAL_IS62WV51216_H

#include "stm32f4xx_hal.h"
#include "hal_types.h"
#include <stdio.h>

/******************************************************************************************************************
***************************************  Модуль - драйвер SRAM IS62WV51216   **************************************
******************************************************************************************************************/
/*
  Данная часть модуля драйвера IS62WV51216 является публичной.
  Модуль предназначен для уравления драйвером через шину FSMC.
  
  Назначение выводов микросхемы SRAM:
          ┌─────────┐
    A18 ──┤1      44├── VCC
    A16 ──┤2      43├── A17
    A14 ──┤3      42├── A15
    A12 ──┤4      41├── A13
    A7  ──┤5      40├── A11
    A6  ──┤6      39├── A8
    A5  ──┤7      38├── A9
    A4  ──┤8      37├── A10
    A3  ──┤9      36├── /CE   (Chip Enable)
    A2  ──┤10     35├── A19   (не используется)
    A1  ──┤11     34├── /OE   (Output Enable)
    A0  ──┤12     33├── /WE   (Write Enable)
    DQ0 ──┤13     32├── /LB   (Lower Byte)
    DQ1 ──┤14     31├── /UB   (Upper Byte)
    DQ2 ──┤15     30├── DQ15
    DQ3 ──┤16     29├── DQ14
    DQ4 ──┤17     28├── DQ13
    DQ5 ──┤18     27├── DQ12
    DQ6 ──┤19     26├── DQ11
    DQ7 ──┤20     25├── DQ10
    DQ8 ──┤21     24├── DQ9
    GND ──┤22     23├── VCCQ  (Power for I/O)
          └─────────┘
  
  Контакты управления микросхемы SRAM:
    D0-D15  – 16 битная шина для чтения\записи данных
    A0-A18  – 19 битная шина адреса памяти
    CE      – разрешение работы с микросхемой (0 - активный) 
    OE      – разрешение чтения
    WE      – разрешение записи
    LB      – управление младшим байтом данных
    UB      – управление старшим байтом данных
    
  Питание микросхемы SRAM:
    VCC     - Основное питание (3.3V) - выводы 44, 23
    VCCQ    - Питание выходных буферов (3.3V) - вывод 23
    GND     - Земля - вывод 22    

  !!! Важные заметки !!!
    OE и WE - никогда не должны быть активны одновременно
    LB и UB - позволяют работать с отдельными байтами
    Все неиспользуемые входы должны быть подтянуты к VCC или GND
    
  !!!
    Для теста связи зарезервирована одна ячейка памяти IS62WV51216_TEST_CONNECTION_ADR,
    учитывайте при разметке пространства SRAM.
  !!!
    Если FSMC настроена в 16 битном режиме и вкл. аппартная работа контактов LB и UB, 
    то при записи 1 байта (старший\младший), требуется прочитать ячейку 16 бит, изменить требуемый байт,
    затем записать 16 бит. Это менее быстрая операция, чем записать сразу 16 бит.
*/
//-----------------------------------------------------------------------------------------------------------------

/******************************************************************************************************************
***********************************  Настраиваемые макроопределения модуля    *************************************
******************************************************************************************************************/
/**
  * @brief    Текстовая отладка модуля (true\false)
  * @warning  Замедляет скорость работы модуля, не использовать в релизных версиях.
  */
#define IS62WV51216_DEBUG                 true
/**
  * @brief    Проверка входных данных в функиях (true\false)
  * @details  Если выключена, это ускоряет процесс чтения\записи
  * @warning  Если выключена, может привести к аварийному завершению программы.
              В случаях, когда в функцию передаются некорректные значения.
  */
#define IS62WV51216_CHECK_FUNCTION        true
/**
  * @brief    Включить программное управление контактами выбора байта (старший младший)
  * @details  Если требуется часто писать по 1 байту в 16 битном режиме (это ускорит запись данных) 
  */
#define IS62WV51216_SOFTWARE_LB_UB        false
/**
  * @brief    Включить код инициализации и операций чтения\записи массива данных по DMA
  */
#define IS62WV51216_DMA_ON                true
  
#if IS62WV51216_DMA_ON
/**
  * @brief    Номер используемого потока DMA
  * @details  Любой свободный (от 0-7), номер канала не имеет значения
  */
#define IS62WV51216_DMA_STREAM            DMA2_Stream1
/**
  * @brief    Включить программное ожидание окончания выполнения операции чтения\записи массива данных
  * @details  Используется функция HAL_DMA_PollForTransfer(). 
              Если требуется выполнять операции последовательно (например, в потоке RTOS).
  * @warning  !!! Без RTOS будет задерживать программу, до окончания выполнения операции
  */
#define IS62WV51216_DMA_POLLING           true
/**
  * @brief    Время ожидания окончания выполнения операции чтения\записи массива данных
  * @details  Если включен IS62WV51216_DMA_POLLING
  */
#if IS62WV51216_DMA_POLLING
#define IS62WV51216_DMA_POLLING_TMO       100 
#endif

#endif

/**
  * @brief    Кол-во микросхем на шине FSMC
  * @details  Обычно не более 4 микросхем, т.к. кол-во контатков NE от 1-4 на шине FSMC
  */
#define IS62WV51216_N_DRIVERS             1U    
/**
  * @brief    Настройки разрядности шины данных FSMCC
  * @details  Обычно 8 или 16 бит (IS62WV51216_FSMC_DATA_8_BIT \ IS62WV51216_FSMC_DATA_16_BIT)
  */
#define IS62WV51216_FSMC_BIT_DETH         IS62WV51216_FSMC_DATA_16_BIT  
/**
  * @brief Настройки адресации памяти для работы с шиной FSMC
  */
#define IS62WV51216_FSMC_BANK_SIZE        0x04000000U // размер банка памяти
#define IS62WV51216_FSMC_MEMORY_BASE      0x60000000U // базовый начальный адрес
#define IS62WV51216_FSMC_NUM_NE           3U          // номер контакта NE (от 0-3)
/**
  * @brief    Размер памяти микросхемы (кило слов)
  * @details  Значение указано на маркировке микросхемы (512 = 1 Мбайт)
              8 388 608 бит->1 048 576 байт->524 288 полуслов
*/
#define IS62WV51216_SIZE_KWORDS           512U
/**
  * @brief    Адрес и данные для проверки связи с микросхемой (путем чтения\записи данных)
  * @details  Используется последняя ячейка памяти
  * @warning  !!! Т.к. последняя ячейка памяти зарезервирована под диагностику, учытывайте это при разметки памяти !!!
  */
#define IS62WV51216_TEST_CONNECTION_ADR   IS62WV51216_SIZE_HALF_WORDS - 1
#define IS62WV51216_TEST_CONNECTION_DATA  0xABCDU
/**
  * @brief Как часто проверять связь с микросхемой (мс.)
  */  
#define IS62WV51216_TIMOUT_CONNECT        1000U
/**
  * @brief Вкл.\выкл. промежуточный буфер памяти (true\false)
  */  
#define IS62WV51216_BUFFER                false
/**
  * @brief Размер промежуточного буфера
  */
#if IS62WV51216_BUFFER
#define IS62WV51216_BUFFER_SIZE           1024U
#endif

/**
  * @brief Настрока контактов управления LB и UB - позволяют работать с отдельными байтами в 16-битном режиме
  */
#if IS62WV51216_SOFTWARE_LB_UB
#define IS62WV51216_PORT_LB               FSMC_LB_Port                                    
#define IS62WV51216_PIN_LB                FSMC_LB_Pin                                 
#define IS62WV51216_PORT_UB               FSMC_UB_Port                                    
#define IS62WV51216_PIN_UB                FSMC_UB_Pin                                 
#endif
//-----------------------------------------------------------------------------------------------------------------

/******************************************************************************************************************
***********************************  Неизменяемые макроопределения модуля    **************************************
*******************************************************************************************************************/
/**
  * @brief Вкл.\выкл. DMA для шины данных FSMC
  */
#define IS62WV51216_SET_DMA_ON            true
#define IS62WV51216_SET_DMA_OFF           false
/**
  * @brief Разрядность шины данных FSMC
  */
#define IS62WV51216_FSMC_DATA_8_BIT       8U
#define IS62WV51216_FSMC_DATA_16_BIT      16U
/**
  * @brief Пределы единиц измерения памяти IS62WV51216_SIZE_KBYTES
  */  
#define IS62WV51216_BYTE_BITS             8U      // 8 бит в байте
#define IS62WV51216_KBYTE_BYTES           1024U  
#define IS62WV51216_KBYTE_BITS            IS62WV51216_KBYTE_BYTES * IS62WV51216_BYTE_BITS
#define IS62WV51216_MBYTE_KBYTES          1024U
#define IS62WV51216_MBYTE_BYTES           IS62WV51216_KBYTE_BYTES * IS62WV51216_MBYTE_KBYTES
#define IS62WV51216_MBYTE_BITS            IS62WV51216_MBYTE_BYTES * IS62WV51216_BYTE_BITS

#define IS62WV51216_WORLD_BYTES           2U
#define IS62WV51216_WORLD_BITS            IS62WV51216_BYTE_BITS * IS62WV51216_WORLD_BYTES 
#define IS62WV51216_KWORLD_WORLDS         1024U
#define IS62WV51216_KWORLD_BYTES          IS62WV51216_KWORLD_WORLDS * IS62WV51216_WORLD_BYTES     
/**
  * @brief Реальный размер памяти в разных единицах
  */  
#define IS62WV51216_SIZE_BYTES            (IS62WV51216_SIZE_KWORDS * IS62WV51216_KWORLD_WORLDS * 2)// 1 048 576 (байт)
#define IS62WV51216_SIZE_KBYTES           (IS62WV51216_SIZE_BYTES / IS62WV51216_KBYTE_BYTES)       // 1024 (кбайт)
#define IS62WV51216_SIZE_HALF_WORDS       (IS62WV51216_SIZE_KWORDS * IS62WV51216_KBYTE_BYTES)      // 524 288 (16-битных слов)
/**
  * @brief Выбор операции с памятью, чтения\запись данных
  */  
#define IS62WV51216_READ                  false
#define IS62WV51216_WRITE                 true
/**
  * @brief    Выбор байта памяти для чтения\запись
  * @details  Если мин. размер ячйеки памяти 16 бит
  */
#define IS62WV51216_HI_BYTE               true
#define IS62WV51216_LO_BYTE               false
/**
  * @brief Отладка драйвера
  */
#if IS62WV51216_DEBUG
#define IS62WV51216_DEBUG_PRINTF(...)     printf(__VA_ARGS__);
#else
#define IS62WV51216_DEBUG_PRINTF(...)
#endif

#if IS62WV51216_SOFTWARE_LB_UB
/**
  * @brief Управления LB и UB - позволяют работать с отдельными байтами в 16-битном режиме
  */
#define IS62WV51216_LB_WRITE_ON()   HAL_GPIO_WritePin(IS62WV51216_PORT_LB, IS62WV51216_PIN_LB, GPIO_PIN_RESET)
#define IS62WV51216_LB_WRITE_OFF()  HAL_GPIO_WritePin(IS62WV51216_PORT_LB, IS62WV51216_PIN_LB, GPIO_PIN_SET)                              
#define IS62WV51216_UB_WRITE_ON()   HAL_GPIO_WritePin(IS62WV51216_PORT_UB, IS62WV51216_PIN_UB, GPIO_PIN_RESET)
#define IS62WV51216_UB_WRITE_OFF()  HAL_GPIO_WritePin(IS62WV51216_PORT_UB, IS62WV51216_PIN_UB, GPIO_PIN_SET)
/**
  * @brief Включить оба контакта LB и UB - разрешено управление 16 битами
  */
#define IS62WV51216_BOTH_BYTES_ON() \
    do { IS62WV51216_LB_WRITE_OFF(); IS62WV51216_UB_WRITE_OFF(); } while(0)
/**
  * @brief Выключить оба контакта LB и UB - запрещено работать с памятью
  */
#define IS62WV51216_BOTH_BYTES_OFF() \
    do { IS62WV51216_LB_WRITE_ON(); IS62WV51216_UB_WRITE_ON(); } while(0)
/**
  * @brief Включить контакт LB - разрешено управление младшим байтом
  */
#define IS62WV51216_LOW_BYTE_ON() \
    do { IS62WV51216_LB_WRITE_OFF(); IS62WV51216_UB_WRITE_ON();  } while(0)
/**
  * @brief Включить контакт UB - разрешено управление старшим байтом
  */
#define IS62WV51216_HIGH_BYTE_ON() \
    do { IS62WV51216_LB_WRITE_ON();  IS62WV51216_UB_WRITE_OFF(); } while(0)
    
#endif
//-----------------------------------------------------------------------------------------------------------------

/******************************************************************************************************************
****************************  Глобальные структуры, перечисления и объединения модуля   ***************************
*******************************************************************************************************************/
/**
  * @brief Разрядность шины данных
  */
typedef enum {
  IS62WV51216_FSMC_BUS_SIZE_8 = 0U, 
  IS62WV51216_FSMC_BUS_SIZE_16,     
  IS62WV51216_FSMC_BUS_SIZE_32,
} IS62WV51216_FSMC_e_bus_s; // (bus size)

/**
  * @brief Номера объектов управления дисплеями
  */
typedef enum {
  IS62WV51216_NUM_DRV_1 = 0U,       
  IS62WV51216_NUM_DRV_2,        
  IS62WV51216_NUM_DRV_3,
  IS62WV51216_NUM_DRV_4,
  IS62WV51216_NUM_DRV_5,
  IS62WV51216_NUM_DRV_6,
  IS62WV51216_NUM_DRV_7,
  IS62WV51216_NUM_DRV_8,
  IS62WV51216_NUM_DRV_9
} IS62WV51216_e_nums_drvs; // (numbers drivers)

/**
  * @brief Состояния дисплея
  */
typedef enum {
  IS62WV51216_STATE_INIT = 0U, 
  IS62WV51216_STATE_NORMAL,
//  IS62WV51216_STATE_ERR_,
} IS62WV51216_e_state;
  
/**
  * @brief Параметры для работы с дисплеем
  */
typedef struct {
  //--параметры для работы по шине FSMC
  SRAM_HandleTypeDef*         hsram;        // структура для работы с физической шиной FSMC
  IS62WV51216_FSMC_e_bus_s    bus_size;     // разрядность шины данных (8\16 бит)
  bool                        fl_connect;   // флаг - драйвер на связи (1 - да, 0 - нет)
  bool                        fl_check_con; // флаг - проверить драйвер на связи или нет (1 - начать проверку) 
  
#if IS62WV51216_FSMC_BIT_DETH == IS62WV51216_FSMC_DATA_8_BIT
  __IO u8*                    p_memory;     // начальный адрес памяти (нулевой байт - 8 бит)
#else
  __IO u16*                   p_memory;     // начальный адрес памяти (нулевое слово - 16 бит)
#endif
  
  //--общие  
  IS62WV51216_e_state         state;        // состояние дисплея
  u32                         adr:19;       // последнее значение адреса для чтения\записи (19 бит)
  u16                         data;         // последнее значение данных для чтения\записи (16 бит)
#if IS62WV51216_BUFFER
  u8                          buf[IS62WV51216_BUFFER_SIZE]; // промежуточный буфер
#endif
  
  //--счетчики  
#if IS62WV51216_CHECK_FUNCTION
  u32                         cnt_err_fn_data;  // счетчик ошибок - передачи в функцию невернных данных
#endif
  u32                         cnt_err_fsmc_idle;// счетчик ошибок - шина FSMC занята
  u32                         cnt_err_dma;      // счетчик ошибок - проблемы в процессе предечи\приема данным по DMA
  
  u32                         cnt_tm_connect;   // счетчик опроса - как часто проверять связь с микросхемой (сек.)
} IS62WV51216_s_obj;
//-----------------------------------------------------------------------------------------------------------------

/******************************************************************************************************************
**************************************  Прототипы глобальных переменных модуля   **********************************
*******************************************************************************************************************/

//-----------------------------------------------------------------------------------------------------------------

/******************************************************************************************************************
****************************************  Прототипы глобальных функций модуля   ***********************************
*******************************************************************************************************************/
bool IS62WV51216_Init(u8 n_drv, SRAM_HandleTypeDef* hsram, bool fl_dma);  // Инициализация драйвера
void IS62WV51216_Handler(void);                                           // Обработчик данных модуля (положить в main)
void IS62WV51216_Handler_Tm(void);                                        // Обработчик данных модуля в прерывании таймера (положить в таймер 1мс)

void IS62WV51216_DMA_Transfer_Complete(DMA_HandleTypeDef *hdma);          // DMA успешно завершил работу
void IS62WV51216_DMA_Transfer_Error(DMA_HandleTypeDef *hdma);             // DMA не смог завершить работу, возникла ошибка

bool IS62WV51216_Rw_Byte(u8 n_drv, u32 adr, u8* data, bool fl_rw, 
                         bool fl_sb);                                     // Операция чтения\записи байта по заданному адресу (без LB и UB)
bool IS62WV51216_Rw_Data(u8 n_drv, u32 adr, u16* data, u32 size, 
                         bool fl_rw, bool fl_dma);                        // Операция чтения\записи массива данных по заданному адресу

IS62WV51216_s_obj* IS62WV51216_Get_Obj_Link(void);                        // Получить ссылку на объект управления драйвером
//-----------------------------------------------------------------------------------------------------------------

#endif
